Repository: jamesmontemagno/app-trimly
Catalog: Trimly/Localization/Insights.xcstrings
Source language: en
Languages: es, fr

# range.allTime
source: All time
es: Todo el historial
fr: Tout l’historique

# range.sinceGoal
source: Since goal
es: Desde el objetivo
fr: Depuis l’objectif

# range.custom
source: Custom range
es: Intervalo personalizado
fr: Période personnalisée

# range.short.year
source: 1Y
es: 1 a
fr: 1 a

# range.more
source: More
es: Más
fr: Plus

# range.start
source: Start date
es: Fecha de inicio
fr: Date de début

# range.end
source: End date
es: Fecha de fin
fr: Date de fin

# range.noGoal
source: Set a goal to view its date range.
es: Establece un objetivo para ver su intervalo de fechas.
fr: Définissez un objectif pour afficher sa période.

# range.invalid
source: Choose an end date on or after the start date.
es: Elige una fecha de fin igual o posterior a la fecha de inicio.
fr: Choisissez une date de fin égale ou postérieure à la date de début.

# recap.title
source: Period recap
es: Resumen del período
fr: Bilan de la période

# recap.weekly
source: This week
es: Esta semana
fr: Cette semaine

# recap.monthly
source: This month
es: Este mes
fr: Ce mois-ci

# recap.current
source: Current period
es: Período actual
fr: Période actuelle

# recap.previous
source: Previous period
es: Período anterior
fr: Période précédente

# recap.compare
source: Compare custom periods
es: Comparar períodos personalizados
fr: Comparer des périodes personnalisées

# recap.compareTitle
source: Compare periods
es: Comparar períodos
fr: Comparer les périodes

# recap.explanation
source: Equal elapsed calendar-day windows are compared. A shorter previous month caps both windows. Each logged day has equal weight; missing days are not estimated.
es: Se comparan intervalos con el mismo número de días naturales transcurridos. Si el mes anterior es más corto, se limitan ambos intervalos. Cada día registrado cuenta por igual; los días sin datos no se estiman.
fr: Les périodes comparées comptent autant de jours calendaires écoulés. Un mois précédent plus court limite les deux périodes. Chaque jour enregistré compte autant ; les jours sans données ne sont pas estimés.

# recap.customExplanation
source: Compare daily averages and logging coverage. Periods can have different lengths; missing days are not estimated.
es: Compara promedios diarios y días registrados. Los períodos pueden tener distintas duraciones; los días sin datos no se estiman.
fr: Comparez les moyennes quotidiennes et les jours enregistrés. Les périodes peuvent avoir des durées différentes ; les jours sans données ne sont pas estimés.

# recap.difference
source: Average change from previous period
es: Cambio del promedio respecto al período anterior
fr: Écart de moyenne avec la période précédente

# recap.unavailable
source: Log in both periods to compare averages.
es: Registra datos en ambos períodos para comparar promedios.
fr: Enregistrez des données dans les deux périodes pour comparer les moyennes.

# recap.noMeasurements
source: No measurements in this period
es: No hay mediciones en este período
fr: Aucune mesure sur cette période

# recap.coverage
source: Logging days: %1$lld of %2$lld
es: Días registrados: %1$lld de %2$lld
fr: Jours enregistrés : %1$lld sur %2$lld

# analytics.loggingDays
source: Logging days
es: Días registrados
fr: Jours enregistrés

# analytics.loggingDayAverage
source: Average · last 7 logging days
es: Promedio · últimos 7 días registrados
fr: Moyenne · 7 derniers jours enregistrés

# analytics.samplesExplanation
source: SMA and EMA use logging-day samples, not elapsed calendar days. Missing days are skipped. Earlier history warms the lines before the visible range.
es: SMA y EMA usan muestras de días registrados, no días naturales transcurridos. Se omiten los días sin datos. El historial anterior se usa para iniciar las líneas antes del intervalo visible.
fr: SMA et EMA utilisent les jours enregistrés, pas les jours calendaires écoulés. Les jours sans données sont ignorés. L’historique antérieur initialise les courbes avant la période visible.

# analytics.samplePeriod
source: Logging-day samples: %lld
es: Muestras de días registrados: %lld
fr: Échantillons de jours enregistrés : %lld

# support.insufficient
source: More logging history is needed for a reliable trend.
es: Se necesita más historial de registros para obtener una tendencia fiable.
fr: Davantage d’historique est nécessaire pour une tendance fiable.

# support.sparse
source: Measurements cover fewer than half the days. Trend estimates are unavailable.
es: Hay mediciones en menos de la mitad de los días. No se pueden estimar tendencias.
fr: Les mesures couvrent moins de la moitié des jours. Les estimations de tendance sont indisponibles.

# support.stale
source: No recent measurement. Log again to update the estimate.
es: No hay mediciones recientes. Registra otra para actualizar la estimación.
fr: Aucune mesure récente. Ajoutez-en une pour actualiser l’estimation.

# support.explanation
source: Trends require at least 7 logging days spanning a week, coverage of half the days, and a measurement within 7 days.
es: Las tendencias requieren al menos 7 días registrados a lo largo de una semana, datos en la mitad de los días y una medición en los últimos 7 días.
fr: Les tendances nécessitent au moins 7 jours enregistrés sur une semaine, des données sur la moitié des jours et une mesure datant de 7 jours au maximum.

# support.counts
source: Logging days: %1$lld; calendar days: %2$lld
es: Días registrados: %1$lld; días naturales: %2$lld
fr: Jours enregistrés : %1$lld ; jours calendaires : %2$lld

# plateau.message
source: Little overall change across %lld calendar days.
es: Poco cambio general a lo largo de %lld días naturales.
fr: Peu de variation globale sur %lld jours calendaires.

# plateau.explanation
source: Recent measurements show little overall change and low variation. This describes the data for either gain or loss goals, not a diagnosis or a reason to change your plan.
es: Las mediciones recientes muestran poco cambio general y poca variación. Esto describe los datos tanto para objetivos de aumento como de pérdida; no es un diagnóstico ni un motivo para cambiar tu plan.
fr: Les mesures récentes montrent peu de changement global et de faibles variations. Cela décrit les données pour les objectifs de prise comme de perte de poids, sans constituer un diagnostic ni une raison de modifier votre programme.

# plateau.dismiss
source: Dismiss plateau insight
es: Descartar información de estabilidad
fr: Masquer l’information de stabilité

# chart.dayDetails
source: Entries and notes
es: Registros y notas
fr: Entrées et notes

# chart.dayDetailsHint
source: Opens all entries and notes for this day
es: Abre todos los registros y notas de este día
fr: Ouvre toutes les entrées et notes de ce jour

# chart.notes
source: Has notes
es: Tiene notas
fr: Contient des notes

# chart.chooseDay
source: Choose a logging day
es: Elegir un día registrado
fr: Choisir un jour enregistré

# chart.weightTrend
source: Weight trend
es: Tendencia del peso
fr: Tendance du poids

# chart.date
source: Date
es: Fecha

# chart.series
source: Series
es: Serie
fr: Série

# pace.title
source: Goal pace
es: Ritmo del objetivo
fr: Rythme de l’objectif

# pace.required
source: Required average change
es: Cambio promedio necesario
fr: Variation moyenne nécessaire

# pace.observed
source: Observed change · last 28 days
es: Cambio observado · últimos 28 días
fr: Variation observée · 28 derniers jours

# pace.explanation
source: Arithmetic based on your chosen target and date, not a recommended rate or medical advice. Trends can change.
es: Cálculo basado en el objetivo y la fecha que elegiste, no en un ritmo recomendado ni en consejos médicos. Las tendencias pueden cambiar.
fr: Calcul fondé sur l’objectif et la date que vous avez choisis, et non sur un rythme recommandé ou un avis médical. Les tendances peuvent évoluer.

# pace.noGoal
source: Set a goal to see its pace.
es: Establece un objetivo para ver su ritmo.
fr: Définissez un objectif pour afficher son rythme.

# pace.missingDate
source: Add a target date to your goal to compare pace.
es: Añade una fecha límite al objetivo para comparar el ritmo.
fr: Ajoutez une date cible à votre objectif pour comparer le rythme.

# pace.missingData
source: A valid measurement since the goal started is needed.
es: Se necesita una medición válida desde el inicio del objetivo.
fr: Une mesure valide depuis le début de l’objectif est nécessaire.

# pace.achieved
source: Goal already achieved
es: Objetivo ya alcanzado
fr: Objectif déjà atteint

# pace.expired
source: Target date reached or passed. Choose a future date to compare pace.
es: La fecha límite ha llegado o pasado. Elige una fecha futura para comparar el ritmo.
fr: Date cible atteinte ou dépassée. Choisissez une date future pour comparer le rythme.

# pace.onPace
source: Observed trend meets the chosen pace
es: La tendencia observada cumple el ritmo elegido
fr: La tendance observée respecte le rythme choisi

# pace.behind
source: Observed trend does not currently meet the chosen pace
es: La tendencia observada no cumple actualmente el ritmo elegido
fr: La tendance observée ne respecte pas actuellement le rythme choisi

# pace.weeklyRate
source: %@ per week
es: %@ por semana
fr: %@ par semaine

# pace.remaining
source: Calendar days remaining: %lld
es: Días naturales restantes: %lld
fr: Jours calendaires restants : %lld

# dashboard.customize
source: Customize dashboard
es: Personalizar panel
fr: Personnaliser le tableau de bord

# dashboard.hideWeights
source: Hide dashboard weights
es: Ocultar pesos del panel
fr: Masquer les poids du tableau de bord

# dashboard.privacyTitle
source: Weights hidden
es: Pesos ocultos
fr: Poids masqués

# dashboard.privacyExplanation
source: Weight values and charts are hidden on this dashboard, including from VoiceOver. Other screens remain visible.
es: Los valores de peso y los gráficos se ocultan en este panel, también para VoiceOver. Las demás pantallas siguen visibles.
fr: Les poids et graphiques sont masqués sur ce tableau de bord, y compris pour VoiceOver. Les autres écrans restent visibles.

# dashboard.visibleCards
source: Visible cards
es: Tarjetas visibles
fr: Cartes visibles

# dashboard.hiddenCards
source: Hidden cards
es: Tarjetas ocultas
fr: Cartes masquées

# dashboard.moveUp
source: Move up
es: Mover hacia arriba
fr: Déplacer vers le haut

# dashboard.moveDown
source: Move down
es: Mover hacia abajo
fr: Déplacer vers le bas

# dashboard.hideCard
source: Hide card
es: Ocultar tarjeta
fr: Masquer la carte

# dashboard.showCard
source: Show card
es: Mostrar tarjeta
fr: Afficher la carte

# dashboard.restoreCards
source: Restore default cards
es: Restaurar tarjetas predeterminadas
fr: Rétablir les cartes par défaut

# dashboard.noCards
source: All dashboard cards are hidden. Customize the dashboard to show them again.
es: Todas las tarjetas del panel están ocultas. Personaliza el panel para mostrarlas de nuevo.
fr: Toutes les cartes du tableau de bord sont masquées. Personnalisez-le pour les afficher à nouveau.

# range.short.week
source: 7D
fr: 7 j
